ApacheBench Test Results&Report/myproxy100.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      1
Time taken for tests:   0.460 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      313600 bytes
HTML transferred:       300000 bytes
Requests per second:    217.53 [#/sec] (mean)
Time per request:       4.597 [ms] (mean)
Time per request:       4.597 [ms] (mean, across all concurrent requests)
Transfer rate:          666.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       7
Processing:     0    4   4.5      3      17
Waiting:        0    4   4.4      3      17
Total:          0    5   4.5      4      17

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      8
  75%      8
  80%     10
  90%     10
  95%     13
  98%     13
  99%     17
 100%     17 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      2
Time taken for tests:   0.297 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      313600 bytes
HTML transferred:       300000 bytes
Requests per second:    336.64 [#/sec] (mean)
Time per request:       5.941 [ms] (mean)
Time per request:       2.971 [ms] (mean, across all concurrent requests)
Transfer rate:          1030.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.4      0      10
Processing:     0    5   5.2      6      24
Waiting:        0    5   5.1      5      23
Total:          0    6   5.2      7      24

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%     10
  80%     10
  90%     12
  95%     13
  98%     23
  99%     24
 100%     24 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      3
Time taken for tests:   0.520 seconds
Complete requests:      100
Failed requests:        3
   (Connect: 0, Receive: 0, Length: 3, Exceptions: 0)
Total transferred:      304600 bytes
HTML transferred:       291000 bytes
Requests per second:    192.24 [#/sec] (mean)
Time per request:       15.606 [ms] (mean)
Time per request:       5.202 [ms] (mean, across all concurrent requests)
Transfer rate:          571.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:     2   15   9.8     11      50
Waiting:        1   14  10.0     10      50
Total:          2   15   9.9     11      52

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     15
  75%     18
  80%     20
  90%     30
  95%     40
  98%     50
  99%     52
 100%     52 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      4
Time taken for tests:   0.320 seconds
Complete requests:      100
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Total transferred:      283600 bytes
HTML transferred:       270000 bytes
Requests per second:    312.07 [#/sec] (mean)
Time per request:       12.818 [ms] (mean)
Time per request:       3.204 [ms] (mean, across all concurrent requests)
Transfer rate:          864.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       7
Processing:     3   12   5.0     12      28
Waiting:        3   11   4.2     10      21
Total:          3   12   4.9     12      28

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     14
  75%     17
  80%     18
  90%     20
  95%     20
  98%     25
  99%     28
 100%     28 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      5
Time taken for tests:   0.312 seconds
Complete requests:      100
Failed requests:        7
   (Connect: 0, Receive: 0, Length: 7, Exceptions: 0)
Total transferred:      292600 bytes
HTML transferred:       279000 bytes
Requests per second:    320.58 [#/sec] (mean)
Time per request:       15.597 [ms] (mean)
Time per request:       3.119 [ms] (mean, across all concurrent requests)
Transfer rate:          916.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       8
Processing:     0   15   4.7     15      30
Waiting:        0   14   5.0     13      27
Total:          3   15   4.7     16      30

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     18
  75%     20
  80%     20
  90%     20
  95%     21
  98%     22
  99%     30
 100%     30 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      6
Time taken for tests:   0.313 seconds
Complete requests:      100
Failed requests:        11
   (Connect: 0, Receive: 0, Length: 11, Exceptions: 0)
Total transferred:      280600 bytes
HTML transferred:       267000 bytes
Requests per second:    319.96 [#/sec] (mean)
Time per request:       18.752 [ms] (mean)
Time per request:       3.125 [ms] (mean, across all concurrent requests)
Transfer rate:          876.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       7
Processing:     5   18   4.7     19      30
Waiting:        5   16   4.6     17      30
Total:          5   18   4.7     19      30

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     20
  75%     20
  80%     21
  90%     23
  95%     27
  98%     30
  99%     30
 100%     30 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      7
Time taken for tests:   8.307 seconds
Complete requests:      100
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Total transferred:      289600 bytes
HTML transferred:       276000 bytes
Requests per second:    12.04 [#/sec] (mean)
Time per request:       581.478 [ms] (mean)
Time per request:       83.068 [ms] (mean, across all concurrent requests)
Transfer rate:          34.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.1      0     520
Processing:     2  496  99.2    520     520
Waiting:        2  496  99.3    520     520
Total:          2  579 209.5    520    1040

Percentage of the requests served within a certain time (ms)
  50%    520
  66%    520
  75%    520
  80%    520
  90%   1030
  95%   1040
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      8
Time taken for tests:   8.244 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      310600 bytes
HTML transferred:       297000 bytes
Requests per second:    12.13 [#/sec] (mean)
Time per request:       659.503 [ms] (mean)
Time per request:       82.438 [ms] (mean, across all concurrent requests)
Transfer rate:          36.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.3      0     520
Processing:    13  576 209.0    520    1040
Waiting:        4  494  99.4    510     520
Total:         13  658 252.9    520    1040

Percentage of the requests served within a certain time (ms)
  50%    520
  66%    520
  75%   1020
  80%   1030
  90%   1030
  95%   1030
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      9
Time taken for tests:   8.282 seconds
Complete requests:      100
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Total transferred:      289600 bytes
HTML transferred:       276000 bytes
Requests per second:    12.07 [#/sec] (mean)
Time per request:       745.375 [ms] (mean)
Time per request:       82.820 [ms] (mean, across all concurrent requests)
Transfer rate:          34.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.3      0     520
Processing:     3  656 263.5    520    1040
Waiting:        3  496 100.8    520     520
Total:          3  739 277.7    520    1040

Percentage of the requests served within a certain time (ms)
  50%    520
  66%   1030
  75%   1039
  80%   1040
  90%   1040
  95%   1040
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      10
Time taken for tests:   8.270 seconds
Complete requests:      100
Failed requests:        5
   (Connect: 0, Receive: 0, Length: 5, Exceptions: 0)
Total transferred:      298600 bytes
HTML transferred:       285000 bytes
Requests per second:    12.09 [#/sec] (mean)
Time per request:       826.983 [ms] (mean)
Time per request:       82.698 [ms] (mean, across all concurrent requests)
Transfer rate:          35.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.9      0     520
Processing:     5  732 285.5    520    1040
Waiting:        5  495 100.1    520     520
Total:          5  815 276.1   1020    1040

Percentage of the requests served within a certain time (ms)
  50%   1020
  66%   1030
  75%   1030
  80%   1040
  90%   1040
  95%   1040
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      11
Time taken for tests:   8.263 seconds
Complete requests:      100
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Total transferred:      295600 bytes
HTML transferred:       282000 bytes
Requests per second:    12.10 [#/sec] (mean)
Time per request:       908.897 [ms] (mean)
Time per request:       82.627 [ms] (mean, across all concurrent requests)
Transfer rate:          34.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.9      0     520
Processing:     3  810 285.9   1020    1040
Waiting:        3  495 100.7    520     521
Total:          3  892 251.9   1027    1040

Percentage of the requests served within a certain time (ms)
  50%   1027
  66%   1040
  75%   1040
  80%   1040
  90%   1040
  95%   1040
  98%   1040
  99%   1040
 100%   1040 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      12
Time taken for tests:   8.252 seconds
Complete requests:      100
Failed requests:        4
   (Connect: 0, Receive: 0, Length: 4, Exceptions: 0)
Total transferred:      301600 bytes
HTML transferred:       288000 bytes
Requests per second:    12.12 [#/sec] (mean)
Time per request:       990.187 [ms] (mean)
Time per request:       82.516 [ms] (mean, across all concurrent requests)
Transfer rate:          35.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.3      0     520
Processing:     5  885 264.4   1030    1042
Waiting:        5  494  99.9    510     523
Total:         10  967 197.8   1030    1042

Percentage of the requests served within a certain time (ms)
  50%   1030
  66%   1030
  75%   1030
  80%   1033
  90%   1037
  95%   1040
  98%   1042
  99%   1042
 100%   1042 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      13
Time taken for tests:   8.280 seconds
Complete requests:      100
Failed requests:        4
   (Connect: 0, Receive: 0, Length: 4, Exceptions: 0)
Total transferred:      301600 bytes
HTML transferred:       288000 bytes
Requests per second:    12.08 [#/sec] (mean)
Time per request:       1076.403 [ms] (mean)
Time per request:       82.800 [ms] (mean, across all concurrent requests)
Transfer rate:          35.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.2      0     520
Processing:     7  966 216.8   1030    1041
Waiting:        7  713 291.9    520    1040
Total:          7 1048 280.1   1037    1560

Percentage of the requests served within a certain time (ms)
  50%   1037
  66%   1040
  75%   1040
  80%   1040
  90%   1550
  95%   1557
  98%   1560
  99%   1560
 100%   1560 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      14
Time taken for tests:   8.275 seconds
Complete requests:      100
Failed requests:        4
   (Connect: 0, Receive: 0, Length: 4, Exceptions: 0)
Total transferred:      301600 bytes
HTML transferred:       288000 bytes
Requests per second:    12.08 [#/sec] (mean)
Time per request:       1158.538 [ms] (mean)
Time per request:       82.753 [ms] (mean, across all concurrent requests)
Transfer rate:          35.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.9      0     520
Processing:     3 1042 291.9   1030    1560
Waiting:        3  742 295.6    520    1040
Total:          3 1125 321.4   1040    1560

Percentage of the requests served within a certain time (ms)
  50%   1040
  66%   1040
  75%   1540
  80%   1540
  90%   1550
  95%   1560
  98%   1560
  99%   1560
 100%   1560 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      15
Time taken for tests:   8.257 seconds
Complete requests:      100
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Total transferred:      307600 bytes
HTML transferred:       294000 bytes
Requests per second:    12.11 [#/sec] (mean)
Time per request:       1238.604 [ms] (mean)
Time per request:       82.574 [ms] (mean, across all concurrent requests)
Transfer rate:          36.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.5      0     520
Processing:     3 1112 341.1   1030    1560
Waiting:        3  741 295.0    520    1040
Total:          3 1194 350.2   1040    1560

Percentage of the requests served within a certain time (ms)
  50%   1040
  66%   1540
  75%   1540
  80%   1540
  90%   1550
  95%   1560
  98%   1560
  99%   1560
 100%   1560 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      20
Time taken for tests:   8.298 seconds
Complete requests:      100
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Total transferred:      295600 bytes
HTML transferred:       282000 bytes
Requests per second:    12.05 [#/sec] (mean)
Time per request:       1659.577 [ms] (mean)
Time per request:       82.979 [ms] (mean, across all concurrent requests)
Transfer rate:          34.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.6      0     520
Processing:     7 1480 431.4   1555    2080
Waiting:        6  964 466.4   1040    1560
Total:          7 1563 450.0   1560    2080

Percentage of the requests served within a certain time (ms)
  50%   1560
  66%   1560
  75%   2060
  80%   2070
  90%   2080
  95%   2080
  98%   2080
  99%   2080
 100%   2080 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      30
Time taken for tests:   8.300 seconds
Complete requests:      100
Failed requests:        5
   (Connect: 0, Receive: 0, Length: 5, Exceptions: 0)
Total transferred:      298600 bytes
HTML transferred:       285000 bytes
Requests per second:    12.05 [#/sec] (mean)
Time per request:       2490.045 [ms] (mean)
Time per request:       83.001 [ms] (mean, across all concurrent requests)
Transfer rate:          35.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.5      0     520
Processing:     3 2132 715.3   2580    2600
Waiting:        3 1243 622.6   1040    2080
Total:          3 2215 695.2   2580    2600

Percentage of the requests served within a certain time (ms)
  50%   2580
  66%   2581
  75%   2585
  80%   2590
  90%   2595
  95%   2600
  98%   2600
  99%   2600
 100%   2600 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      40
Time taken for tests:   8.310 seconds
Complete requests:      100
Failed requests:        11
   (Connect: 0, Receive: 0, Length: 11, Exceptions: 0)
Total transferred:      280600 bytes
HTML transferred:       267000 bytes
Requests per second:    12.03 [#/sec] (mean)
Time per request:       3323.926 [ms] (mean)
Time per request:       83.098 [ms] (mean, across all concurrent requests)
Transfer rate:          32.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.6      0     520
Processing:     3 2701 1048.9   3100    3640
Waiting:        3 1615 898.2   1550    3110
Total:         10 2784 1044.2   3110    3640

Percentage of the requests served within a certain time (ms)
  50%   3110
  66%   3610
  75%   3620
  80%   3620
  90%   3630
  95%   3630
  98%   3640
  99%   3640
 100%   3640 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      50
Time taken for tests:   8.280 seconds
Complete requests:      100
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      286600 bytes
HTML transferred:       273000 bytes
Requests per second:    12.08 [#/sec] (mean)
Time per request:       4140.073 [ms] (mean)
Time per request:       82.801 [ms] (mean, across all concurrent requests)
Transfer rate:          33.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.6      0     520
Processing:    25 3173 1361.1   4097    4640
Waiting:       10 2224 1246.6   2078    4137
Total:         25 3255 1361.1   4097    4640

Percentage of the requests served within a certain time (ms)
  50%   4097
  66%   4118
  75%   4121
  80%   4137
  90%   4617
  95%   4638
  98%   4640
  99%   4640
 100%   4640 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      60
Time taken for tests:   8.279 seconds
Complete requests:      100
Failed requests:        23
   (Connect: 0, Receive: 0, Length: 23, Exceptions: 0)
Total transferred:      244600 bytes
HTML transferred:       231000 bytes
Requests per second:    12.08 [#/sec] (mean)
Time per request:       4967.526 [ms] (mean)
Time per request:       82.792 [ms] (mean, across all concurrent requests)
Transfer rate:          28.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.4      0     520
Processing:     3 3677 1622.1   4628    5190
Waiting:        3 2356 1300.2   2570    4628
Total:        520 3759 1608.5   4628    5190

Percentage of the requests served within a certain time (ms)
  50%   4628
  66%   5160
  75%   5160
  80%   5160
  90%   5180
  95%   5190
  98%   5190
  99%   5190
 100%   5190 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      70
Time taken for tests:   8.305 seconds
Complete requests:      100
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Total transferred:      289600 bytes
HTML transferred:       276000 bytes
Requests per second:    12.04 [#/sec] (mean)
Time per request:       5813.613 [ms] (mean)
Time per request:       83.052 [ms] (mean, across all concurrent requests)
Transfer rate:          34.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.5      0     520
Processing:    10 3836 2033.9   4140    6230
Waiting:        8 2461 1639.6   2080    5695
Total:         10 3919 2031.6   4140    6230

Percentage of the requests served within a certain time (ms)
  50%   4140
  66%   5690
  75%   5710
  80%   6210
  90%   6220
  95%   6230
  98%   6230
  99%   6230
 100%   6230 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      80
Time taken for tests:   8.250 seconds
Complete requests:      100
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Total transferred:      289600 bytes
HTML transferred:       276000 bytes
Requests per second:    12.12 [#/sec] (mean)
Time per request:       6599.751 [ms] (mean)
Time per request:       82.497 [ms] (mean, across all concurrent requests)
Transfer rate:          34.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.2      0     520
Processing:    10 4084 2235.1   4100    7207
Waiting:       10 2990 2074.9   2570    6697
Total:         10 4166 2231.1   4610    7207

Percentage of the requests served within a certain time (ms)
  50%   4610
  66%   5640
  75%   6669
  80%   6675
  90%   6690
  95%   7180
  98%   7207
  99%   7207
 100%   7207 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      90
Time taken for tests:   8.273 seconds
Complete requests:      100
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Total transferred:      289600 bytes
HTML transferred:       276000 bytes
Requests per second:    12.09 [#/sec] (mean)
Time per request:       7445.428 [ms] (mean)
Time per request:       82.727 [ms] (mean, across all concurrent requests)
Transfer rate:          34.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 190.1      0     523
Processing:    13 4180 2430.3   4142    7750
Waiting:        3 3277 2258.7   3102    7220
Total:         13 4262 2426.1   4142    7750

Percentage of the requests served within a certain time (ms)
  50%   4142
  66%   5680
  75%   6710
  80%   6710
  90%   7738
  95%   7750
  98%   7750
  99%   7750
 100%   7750 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        BaseHTTP/0.6
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /3000
Document Length:        3000 bytes

Concurrency Level:      100
Time taken for tests:   8.273 seconds
Complete requests:      100
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      286600 bytes
HTML transferred:       273000 bytes
Requests per second:    12.09 [#/sec] (mean)
Time per request:       8273.031 [ms] (mean)
Time per request:       82.730 [ms] (mean, across all concurrent requests)
Transfer rate:          33.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 189.2      0     523
Processing:    13 4335 2438.2   4643    8230
Waiting:        3 4250 2444.9   4130    8227
Total:         43 4417 2429.3   4643    8230

Percentage of the requests served within a certain time (ms)
  50%   4643
  66%   5658
  75%   6683
  80%   7200
  90%   7710
  95%   8220
  98%   8227
  99%   8230
 100%   8230 (longest request)